import pulp


"""Компанія виробляє продукти А і Б. Для виробництва одиниці продукту А потрібно 5 годин на машині №1 та 3 години на машині №2. 
Для продукту Б — 2 години на машині №1 та 2 години на машині №2. Максимально доступний час роботи машини №1 — 80 годин, а машини №2 — 40 годин. 
Прибуток від продажу одиниці продукту А становить $50, а від продукту Б — $40.
Задача — максимізувати загальний прибуток компанії, вибравши оптимальну кількість продуктів А і Б для виробництва, враховуючи обмеження ресурсів.
А також те, що ми фізично не маємо права виготовляти продукту Б більше, ніж 10 одиниць за раз.
"""

model = pulp.LpProblem('Maximize_profit', pulp.LpMaximize)

A = pulp.LpVariable('A', lowBound=0, cat='Integer')
B = pulp.LpVariable('B',lowBound=0, upBound=10, cat='Integer')

model += 50*A + 40*B, 'Profit'

model += 5*A + 2*B <= 80, 'Constraint1'
model += 3*A + 2*B <= 40, 'Constraint2'

model.solve()
print("Виробляти продуктів А:", A.varValue)
print("Виробляти продуктів Б:", B.varValue)